---
kind: method
id: M:Autodesk.Revit.DB.DocumentVersion.Dispose
source: html/83473a77-badb-5ead-efc5-768ba88b092f.htm
---
# Autodesk.Revit.DB.DocumentVersion.Dispose Method

Releases all resources used by the DocumentVersion

## Syntax (C#)
```csharp
public void Dispose()
```